In [1]:
import random
import pandas as pd
schools = pd.read_csv("schools.csv")
students = pd.read_csv("students.csv")

In [2]:
students.rename(columns = {'Unnamed: 0':'Student Name','Unnamed: 1':'Mobile Number'}, inplace = True)

In [3]:
students = students.drop(index=[0])
students.head()

            Student Name Mobile Number
1     Himaja Reddy Maddi    9133569***
2              Hema Sree    7330782***
3          Vaditya Divya    8897522***
4        Cheruku Deepika    8978245***
5  Bittkunti Sai Deepthi    9515767***

In [4]:
len(schools)

296

In [5]:
randpins = [500004,500045,500007,500043,500101,501102,500010,500044,500013,500047,500004,500101,500044,501301,501301,500015,500091,500040,500020,500058,500043,500064,500037,500034,500027,500004,500012,500016,500003,500075,500078,500092,501301,500010,500010,500011,500075,500022,500050,501301,501301,500037,500005,500078,500046,500081,501401,500008,500024,500086,500062,500033,500062,500015,500018,500053,500065,500096,500029,500055,500001,500080,500097,501401,500008,500020,501401,500068,500010,500014,500042,500047,500066,500029,500025,500051,500054,500028,500064,500008,500001,500002,500013,500048,500091,500076,500082,500031,500055,500040,500007,500101,500062,500007,500087,500087,500085,500033,500008,500058,500006,500088,500077,501301,501301,500005,500004,500003,500064,500030,500101,500100,500088,500084,500010,500085,500072,500006,500062,500055,500101,500074,500101,500017,500017,500063,500008,500081,500036,500047,500005,500006,500089,500009,500032,500098,500097,500003,500049,500001,500002,500040,500101,500028,500020,500020,500083,500044,500008,500029,500026,500056,500063,500044,500007,500027,500078,500090,501401,500036,500036,500060,500025,500004,500101,500039,500009,500090,500016,500088,500095,500069,500025,500041,501401,500088,500030,500029,500056,501301,500037,501401,501301,500024,500059,500059,500094,500008,500088,500018,500018,500038,500059,500035,500003,500001,500013,500065,500101,500028,500061,500082,500073,500013,500036,500001,500095,500027,500067,500055,500052,500064,500007,501301,500078,500008,500015,500101,500053,500079,500070,500038,500004,500044,500057,501101,500093,500018,500072,501301,500023,500045,500020,500013]
scpins= []
for i in range(len(schools)):
    scpins.append(random.choice(randpins))
schools["pincode"]= scpins

In [8]:
stpins = []
for i in range(len(students)):
    stpins.append(random.choice(randpins))
students["pincode"]= stpins

In [9]:
students.head()

            Student Name Mobile Number  pincode
1     Himaja Reddy Maddi    9133569***   500037
2              Hema Sree    7330782***   500008
3          Vaditya Divya    8897522***   500043
4        Cheruku Deepika    8978245***   500018
5  Bittkunti Sai Deepthi    9515767***   500037

In [6]:
schools.head()

                  School Name    Type       City      State  pincode
0  Amara Jyothi Public School  PUBLIC  HYDERABAD  Telangana   500022
1           Amrita Vidyalayam  PUBLIC  HYDERABAD  Telangana   500047
2    Anand Bagh Public School  PUBLIC  HYDERABAD  Telangana   500083
3   Annai Play Nursery School  PUBLIC  HYDERABAD  Telangana   500036
4         Apricot High School  PUBLIC  HYDERABAD  Telangana   501301

In [2]:
import requests
p1= 500001
p2= 500018
url = "https://india-pincode-with-latitude-and-longitude.p.rapidapi.com/api/v1/pincode/distance"
payload = "pincode1="+str(p1)+"&pincode2="+str(p2)+"&unit=km"
headers = {
	"content-type": "application/x-www-form-urlencoded",
	"X-RapidAPI-Key": "8532f1bf4bmsh1f9f8482dd86e18p1483c1jsn58bc6f9e15fe",
	"X-RapidAPI-Host": "india-pincode-with-latitude-and-longitude.p.rapidapi.com"
}

response = requests.request("POST", url, data=payload, headers=headers)

print(response.text)

<html>
<head><title>504 Gateway Time-out</title></head>
<body>
<center><h1>504 Gateway Time-out</h1></center>
</body>
</html>

In [1]:
print('helloworld')

helloworld